OpenEPaperLink/OpenEPaperLink/ARM_Tag_FW/cc2531_OEPL/contiki/sdcc/non-free/include/pic14/pic16hv753.h
#ifndef NO_BIT_DEFINES

#define ADON                    ADCON0bits.ADON                 // bit 0
#define GO_NOT_DONE             ADCON0bits.GO_NOT_DONE          // bit 1
#define CHS0                    ADCON0bits.CHS0                 // bit 2
#define CHS1                    ADCON0bits.CHS1                 // bit 3
#define CHS2                    ADCON0bits.CHS2                 // bit 4
#define CHS3                    ADCON0bits.CHS3                 // bit 5
#define ADFM                    ADCON0bits.ADFM                 // bit 7

#define ADPREF1                 ADCON1bits.ADPREF1              // bit 0
#define ADCS0                   ADCON1bits.ADCS0                // bit 4
#define ADCS1                   ADCON1bits.ADCS1                // bit 5
#define ADCS2                   ADCON1bits.ADCS2                // bit 6

#define ANSA0                   ANSELAbits.ANSA0                // bit 0
#define ANSA1                   ANSELAbits.ANSA1                // bit 1
#define ANSA2                   ANSELAbits.ANSA2                // bit 2
#define ANSA4                   ANSELAbits.ANSA4                // bit 4

#define ANSC0                   ANSELCbits.ANSC0                // bit 0
#define ANSC1                   ANSELCbits.ANSC1                // bit 1
#define ANSC2                   ANSELCbits.ANSC2                // bit 2
#define ANSC3                   ANSELCbits.ANSC3                // bit 3

#define T1GSEL                  APFCONbits.T1GSEL               // bit 4

#define C1SYNC                  C1CON0bits.C1SYNC               // bit 0
#define C1HYS                   C1CON0bits.C1HYS                // bit 1
#define C1SP                    C1CON0bits.C1SP                 // bit 2
#define C1ZLF                   C1CON0bits.C1ZLF                // bit 3
#define C1POL                   C1CON0bits.C1POL                // bit 4
#define C1OE                    C1CON0bits.C1OE                 // bit 5
#define C1OUT                   C1CON0bits.C1OUT                // bit 6
#define C1ON                    C1CON0bits.C1ON                 // bit 7

#define C1NCH0                  C1CON1bits.C1NCH0               // bit 0
#define C1NCH1                  C1CON1bits.C1NCH1               // bit 1
#define C1NCH2                  C1CON1bits.C1NCH2               // bit 2
#define C1PCH0                  C1CON1bits.C1PCH0               // bit 3
#define C1PCH1                  C1CON1bits.C1PCH1               // bit 4
#define C1PCH2                  C1CON1bits.C1PCH2               // bit 5
#define C1INTN                  C1CON1bits.C1INTN               // bit 6
#define C1INTP                  C1CON1bits.C1INTP               // bit 7

#define C2SYNC                  C2CON0bits.C2SYNC               // bit 0
#define C2HYS                   C2CON0bits.C2HYS                // bit 1
#define C2SP                    C2CON0bits.C2SP                 // bit 2
#define C2ZLF                   C2CON0bits.C2ZLF                // bit 3
#define C2POL                   C2CON0bits.C2POL                // bit 4
#define C2OE                    C2CON0bits.C2OE                 // bit 5
#define C2OUT                   C2CON0bits.C2OUT                // bit 6
#define C2ON                    C2CON0bits.C2ON                 // bit 7

#define C2NCH0                  C2CON1bits.C2NCH0               // bit 0
#define C2NCH1                  C2CON1bits.C2NCH1               // bit 1
#define C2NCH2                  C2CON1bits.C2NCH2               // bit 2
#define C2PCH0                  C2CON1bits.C2PCH0               // bit 3
#define C2PCH1                  C2CON1bits.C2PCH1               // bit 4
#define C2PCH2                  C2CON1bits.C2PCH2               // bit 5
#define C2INTN                  C2CON1bits.C2INTN               // bit 6
#define C2INTP                  C2CON1bits.C2INTP               // bit 7

#define CCP1M0                  CCP1CONbits.CCP1M0              // bit 0
#define CCP1M1                  CCP1CONbits.CCP1M1              // bit 1
#define CCP1M2                  CCP1CONbits.CCP1M2              // bit 2
#define CCP1M3                  CCP1CONbits.CCP1M3              // bit 3
#define DC1B0                   CCP1CONbits.DC1B0               // bit 4
#define DC1B1                   CCP1CONbits.DC1B1               // bit 5

#define MCOUT1                  CMOUTbits.MCOUT1                // bit 0
#define MCOUT2                  CMOUTbits.MCOUT2                // bit 1

#define G1ASD0L0                COG1ASD0bits.G1ASD0L0           // bit 2
#define G1ASD0L1                COG1ASD0bits.G1ASD0L1           // bit 3
#define G1ASD1L0                COG1ASD0bits.G1ASD1L0           // bit 4
#define G1ASD1L1                COG1ASD0bits.G1ASD1L1           // bit 5
#define G1ARSEN                 COG1ASD0bits.G1ARSEN            // bit 6
#define G1ASDE                  COG1ASD0bits.G1ASDE             // bit 7

#define G1ASDSFLT               COG1ASD1bits.G1ASDSFLT          // bit 0
#define G1ASDSC1                COG1ASD1bits.G1ASDSC1           // bit 1
#define G1ASDSC2                COG1ASD1bits.G1ASDSC2           // bit 2
#define G1ASDSHLT1              COG1ASD1bits.G1ASDSHLT1         // bit 3
#define G1ASDSHLT2              COG1ASD1bits.G1ASDSHLT2         // bit 4

#define G1BKF0                  COG1BKFbits.G1BKF0              // bit 0
#define G1BKF1                  COG1BKFbits.G1BKF1              // bit 1
#define G1BKF2                  COG1BKFbits.G1BKF2              // bit 2
#define G1BKF3                  COG1BKFbits.G1BKF3              // bit 3

#define G1BKR0                  COG1BKRbits.G1BKR0              // bit 0
#define G1BKR1                  COG1BKRbits.G1BKR1              // bit 1
#define G1BKR2                  COG1BKRbits.G1BKR2              // bit 2
#define G1BKR3                  COG1BKRbits.G1BKR3              // bit 3

#define G1MD                    COG1CON0bits.G1MD               // bit 0
#define G1LD                    COG1CON0bits.G1LD               // bit 2
#define G1POL0                  COG1CON0bits.G1POL0             // bit 3
#define G1POL1                  COG1CON0bits.G1POL1             // bit 4
#define G1OE0                   COG1CON0bits.G1OE0              // bit 5
#define G1OE1                   COG1CON0bits.G1OE1              // bit 6
#define G1EN                    COG1CON0bits.G1EN               // bit 7

#define G1CS0                   COG1CON1bits.G1CS0              // bit 0
#define G1CS1                   COG1CON1bits.G1CS1              // bit 1
#define G1FDBTS                 COG1CON1bits.G1FDBTS            // bit 6
#define G1RDBTS                 COG1CON1bits.G1RDBTS            // bit 7

#define G1DBF0                  COG1DBFbits.G1DBF0              // bit 0
#define G1DBF1                  COG1DBFbits.G1DBF1              // bit 1
#define G1DBF2                  COG1DBFbits.G1DBF2              // bit 2
#define G1DBF3                  COG1DBFbits.G1DBF3              // bit 3

#define G1DBR0                  COG1DBRbits.G1DBR0              // bit 0
#define G1DBR1                  COG1DBRbits.G1DBR1              // bit 1
#define G1DBR2                  COG1DBRbits.G1DBR2              // bit 2
#define G1DBR3                  COG1DBRbits.G1DBR3              // bit 3

